In [78]:
import csv
import pandas as pd
import matplotlib.pyplot as plt

mortgage_data_path = "/Users/ylsstudent/Documents/Data_Analytics_Bootcamp/Projects/BootCampProject1/resources/MORTGAGE30US.csv"

In [33]:
mortgage_df = pd.read_csv(mortgage_data_path)

In [35]:
mortgage_df.dtypes

DATE             object
MORTGAGE30US    float64
dtype: object

In [37]:
mortgage_df["DATE"] = pd.to_datetime(mortgage_df["DATE"])

In [39]:
mortgage_df["YEAR"] = mortgage_df["DATE"].dt.year

        DATE  MORTGAGE30US  YEAR
0 1971-04-02          7.33  1971
1 1971-04-09          7.31  1971
2 1971-04-16          7.31  1971
3 1971-04-23          7.31  1971
4 1971-04-30          7.29  1971

In [72]:
average_mortgage_by_year = mortgage_df.groupby("YEAR")["MORTGAGE30US"].mean().reset_index()
median_mortgage_by_year = mortgage_df.groupby("YEAR")["MORTGAGE30US"].median().reset_index()

In [47]:
average_mortgage_by_year

    YEAR  MORTGAGE30US
0   1971      7.541750
1   1972      7.383269
2   1973      8.044808
3   1974      9.187115
4   1975      9.047115
5   1976      8.865849
6   1977      8.845192
7   1978      9.641731
8   1979     11.203654
9   1980     13.742115
10  1981     16.641509
11  1982     16.043654
12  1983     13.235385
13  1984     13.877692
14  1985     12.430192
15  1986     10.187308
16  1987     10.213396
17  1988     10.341731
18  1989     10.319423
19  1990     10.129423
20  1991      9.246538
21  1992      8.390189
22  1993      7.314615
23  1994      8.380769
24  1995      7.934615
25  1996      7.806154
26  1997      7.598846
27  1998      6.942642
28  1999      7.440000
29  2000      8.053462
30  2001      6.967885
31  2002      6.537308
32  2003      5.826981
33  2004      5.839231
34  2005      5.866731
35  2006      6.413269
36  2007      6.337308
37  2008      6.027170
38  2009      5.036538
39  2010      4.689808
40  2011      4.447885
41  2012      3.657500
42  2013      3.975577
43  2014      4.168868
44  2015      3.850577
45  2016      3.654038
46  2017      3.989808
47  2018      4.544615
48  2019      3.935769
49  2020      3.111698
50  2021      2.957692
51  2022      5.344038
52  2023      6.806731
53  2024      6.864194

In [11]:
education_data_path = "/Users/ylsstudent/Documents/Data_Analytics_Bootcamp/Projects/BootCampProject1/resources/Years of School Completed by People 25 Years and Over.csv"

education_df = pd.read_csv(education_data_path)

education_df.dtypes

,Year,Total,0 to 4 years (Elementary),5 to 8 years (Elementary),1 to 3 years (High School),4 years (High School),1 to 3 years (College),4 years or more (College)
0,2022,"226,274","2,203","5,732","11,998","64,465","56,659","85,217"
1,2021,"224,580","2,074","5,862","12,118","62,547","56,942","85,037"
2,2020,"223,058","2,106","5,788","12,313","61,597","57,552","83,701"
3,2019,"221,478","2,181","6,422","13,372","62,259","57,428","79,816"
4,2018,"219,830","2,129","6,600","13,682","62,685","57,810","76,924"

In [13]:
for column in education_df.columns:
    education_df[column] = education_df[column].astype(str).str.replace(",", "").astype(float)

education_df.head()

,Year,Total,0 to 4 years (Elementary),5 to 8 years (Elementary),1 to 3 years (High School),4 years (High School),1 to 3 years (College),4 years or more (College)
0,2022.0,226274.0,2203.0,5732.0,11998.0,64465.0,56659.0,85217.0
1,2021.0,224580.0,2074.0,5862.0,12118.0,62547.0,56942.0,85037.0
2,2020.0,223058.0,2106.0,5788.0,12313.0,61597.0,57552.0,83701.0
3,2019.0,221478.0,2181.0,6422.0,13372.0,62259.0,57428.0,79816.0
4,2018.0,219830.0,2129.0,6600.0,13682.0,62685.0,57810.0,76924.0

In [15]:
education_percentage_df = education_df.copy()

In [17]:
for column in education_percentage_df.columns[2:]:
    education_percentage_df[column] = education_percentage_df[column] / education_percentage_df["Total"] * 100

education_percentage_df.head()

,Year,Total,0 to 4 years (Elementary),5 to 8 years (Elementary),1 to 3 years (High School),4 years (High School),1 to 3 years (College),4 years or more (College)
0,2022.0,226274.0,0.973598,2.533212,5.302421,28.489796,25.039996,37.660977
1,2021.0,224580.0,0.923502,2.610206,5.395850,27.850655,25.354885,37.864903
2,2020.0,223058.0,0.944149,2.594841,5.520089,27.614791,25.801361,37.524321
3,2019.0,221478.0,0.984748,2.899611,6.037620,28.110693,25.929438,36.037891
4,2018.0,219830.0,0.968476,3.002320,6.223900,28.515216,26.297594,34.992494

In [53]:
homes_data = "/Users/ylsstudent/Documents/Data_Analytics_Bootcamp/Projects/BootCampProject1/resources/Number_Houses_Sold.csv"

In [59]:
homes_df = pd.read_csv(homes_data)
homes_df.dtypes

Year           float64
Total (USA)     object
Northeast      float64
MidWest        float64
South          float64
West           float64
dtype: object

In [64]:
homes_df.head()

     Year Total (USA)  Northeast  MidWest  South   West
0  1963.0         560       87.0    134.0  199.0  141.0
1  1964.0         565       90.0    146.0  200.0  129.0
2  1965.0         575       94.0    142.0  210.0  129.0
3  1966.0         461       84.0    113.0  166.0   99.0
4  1967.0         487       77.0    112.0  179.0  119.0

In [68]:
homes_df["Total (USA)"].astype(str).str.replace(",", "").astype(float)
homes_df.head()

     Year Total (USA)  Northeast  MidWest  South   West
0  1963.0         560       87.0    134.0  199.0  141.0
1  1964.0         565       90.0    146.0  200.0  129.0
2  1965.0         575       94.0    142.0  210.0  129.0
3  1966.0         461       84.0    113.0  166.0   99.0
4  1967.0         487       77.0    112.0  179.0  119.0

In [82]:
med_avg_merged = pd.merge(average_mortgage_by_year, median_mortgage_by_year, on='YEAR')

plt.figure(figsize=(10, 6))
plt.plot(med_avg_merged['YEAR'], med_avg_merged['Average Mortgage'], marker='o', label='Average Mortgage')
plt.plot(med_avg_merged['YEAR'], med_avg_merged['Median Mortgage'], marker='o', label='Median Mortgage')
plt.xlabel('Year')
plt.ylabel('Mortgage Value')
plt.title('Average and Median Mortgage by Year')
plt.legend()
plt.grid(True)
plt.show()

KeyError: 'Average Mortgage'